# Задание 1. Задача с именами

In [1]:
import pandas as pd

name_data = pd.read_csv('/Users/garynich/Documents/Tetrica School/names.txt', sep=',', header=None)
name_data = name_data.transpose()
name_data.columns = ['names']

name_data.info(), name_data.head(6)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5165 entries, 0 to 5164
Data columns (total 1 columns):
names    5164 non-null object
dtypes: object(1)
memory usage: 80.7+ KB

(None,        names
 0       MARY
 1   PATRICIA
 2      LINDA
 3    BARBARA
 4  ELIZABETH
 5   JENNIFER)

## 1. Отсортировать все имена в лексикографическом порядке

In [2]:
result = name_data.sort_values(by  = 'names')

result.head(3)

      names
2700  AARON
1582  ABBEY
1040  ABBIE

In [3]:
result.tail(3)

       names
2186  ZULEMA
2063   ZULMA
3302     NaN

## 2. Посчитать для каждого имени алфавитную сумму – сумму порядковых номеров букв (MAY: 13 + 1 + 25 = 39)

In [4]:
def getSum(name):
    sum = 0
    try:
        for each in name:
                sum = sum + ord(each)%32
    except:
        pass
    return sum



result['alph_sum'] = result['names'].apply(getSum)
result.head(3)

      names  alph_sum
2700  AARON        49
1582  ABBEY        35
1040  ABBIE        19

## 3. Умножить алфавитную сумму каждого имени на порядковый номер имени в отсортированном списке (индексация начинается с 1). Например, если MAY находится на 63 месте в списке, то результат для него будет 63 * 39 = 2457

In [5]:
result = result.reset_index()
result['multipl'] = result['alph_sum'] * (result.index+1)
result.head(3)

   index  names  alph_sum  multipl
0   2700  AARON        49       49
1   1582  ABBEY        35       70
2   1040  ABBIE        19       57

## 4. Просуммировать произведения из п. 3 для всех имен из файла и получить число. Это число и будет ответом

In [6]:
result['multipl'].sum()

871695740

# Ответ: 871695740
# ======================================